blog_app/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("comment", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "hi !!"], ["created_at", Wed, 07 Dec 2011 04:37:06 UTC +00:00], ["name", "paul"], ["post_id", 3], ["updated_at", Wed, 07 Dec 2011 04:37:06 UTC +00:00]]
---
 def create
  post = Post.find params[:post_id]
  post.comments.create params[:comment]